app/controllers/contents_controller.rb

  def index
    @contents = Content.all.order("created_at DESC").paginate(page: params[:page], per_page: 30)
---
SELECT  "contents".* FROM "contents" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]

  def create
    @content = current_user.contents.build(content_params)

    respond_to do |format|
      if @content.save
---
INSERT INTO "contents" ("titolo", "descrizione", "price", "created_at", "updated_at", "user_id", "cover_file_name", "cover_content_type", "cover_file_size", "cover_updated_at", "allegato_file_name", "allegato_content_type", "allegato_file_size", "allegato_updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @content.update(content_params)
---
UPDATE "contents" SET "price" = ?, "updated_at" = ? WHERE "contents"."id" = ?  [["price", 12.0], ["updated_at", "2020-01-15 13:14:28.854481"], ["id", 3]]

    def set_content
      @content = Content.friendly.find(params[:id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]